def gauss(A, b):
  # Копіюємо матрицю і вектор, щоб не змінювати оригінали
  A = [row[:] for row in A]
  b = b[:]

  n = len(A) # Кількість рядків
  m = len(A[0]) # Кількість стовпців

  # Прямий хід - приводимо матрицю до сходинчастого вигляду
  for k in range(min(n, m)):
    # Шукаємо максимальний за модулем елемент в k-му стовпці
    max_row = k
    for i in range(k + 1, n):
      if abs(A[i][k]) > abs(A[max_row][k]):
        max_row = i
    # Переставляємо рядки місцями
    A[k], A[max_row] = A[max_row], A[k]
    b[k], b[max_row] = b[max_row], b[k]

    # Ділимо k-й рядок на A[k][k]
    div = A[k][k]
    A[k] = [a / div for a in A[k]]
    b[k] /= div

    # Віднімаємо k-й рядок від нижчих рядків
    for i in range(k + 1, n):
      mult = A[i][k]
      A[i] = [a - mult * b for a, b in zip(A[i], A[k])]
      b[i] -= mult * b[k]

  # Зворотній хід - знаходимо розв'язок системи
  x = [0] * m # Список для збереження розв'язку
  for k in range(min(n, m) - 1, -1, -1):
    # Виражаємо x[k] через x[k+1], x[k+2], ...
    x[k] = b[k] - sum(x[i] * a for i, a in enumerate(A[k][k+1:], k+1))
  
  return x # Повертаємо розв'язок

# Задаємо параметри матриці
'''A = [[4, 1, 2], [3, 5, 2], [1, 1, 3]]
b = [4, 7, 3]'''
A = [[1, 2, -1, 1], 
     [2, 1, 1, 1], 
     [1, -1, 2, 1], 
     [1, 1, -1, 3]]
b = [6, 9, 3, 4]
# Викликаємо функцію для розв'язання системи
x = gauss(A, b)

# Виводимо розв'язок
print("Розв'язок системи:")
for i in range(len(x)):
    print("x[{}] = {}".format(i + 1, x[i]))